Klassendiagram aktuallisiert
